Repository: sunpebble/fresh-pantry
Catalog: apps/ios/FreshPantry/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, fr, ja

# inventory.detail.currentQuantity
source: 当前数量
en: Current quantity
fr: Quantité actuelle
ja: 現在の数量

# inventory.detail.dataSource
source: 数据来源：Open Food Facts
en: Data source: Open Food Facts
fr: Source des données : Open Food Facts
ja: データ提供元：Open Food Facts

# inventory.detail.expiryDate
source: 到期日
en: Expiry date
fr: Date d'expiration
ja: 賞味期限日

# inventory.detail.freshness
source: 新鲜度
en: Freshness
fr: Fraîcheur
ja: 新鮮度

# inventory.detail.shelfLifeSuggestion
source: 保质期建议
en: Suggested shelf life
fr: Durée de conservation suggérée
ja: 推奨賞味期限

# inventory.editIngredient.save
source: 保存
en: Save
fr: Enregistrer

# inventory.editIngredient.saveFailed
source: 保存失败，请重试
en: Couldn't save — try again
fr: Impossible d'enregistrer — veuillez réessayer
ja: 保存に失敗しました。再度お試しください

# inventory.editIngredient.saving
source: 保存中…
en: Saving…
fr: Enregistrement en cours…

# inventory.editIngredient.title
source: 编辑食材
en: Edit ingredient
fr: Modifier l'ingrédient
ja: 食材を編集

# inventory.empty.addSome
source: 去添加一些食材吧
en: Go add some ingredients
fr: Ajoutez quelques ingrédients
ja: 食材を追加しましょう

# inventory.empty.noMatchForFilter
source: 该筛选下暂无食材
en: No ingredients match this filter
fr: Aucun ingrédient ne correspond à ce filtre
ja: この条件に一致する食材はありません

# inventory.empty.notFound %@
source: 没有找到「%@」
en: No results for “%@”
fr: Aucun résultat pour « %@ »
ja: 「%@」は見つかりませんでした

# inventory.empty.title
source: 冰箱空空如也
en: Your fridge is empty
fr: Votre réfrigérateur est vide
ja: 冷蔵庫は空っぽです

# inventory.empty.tryDifferentFilter
source: 试试换个关键词或筛选条件
en: Try a different keyword or filter
fr: Essayez un autre mot-clé ou filtre
ja: 別のキーワードやフィルターを試してください

# inventory.expiryScan.action
source: 拍照识别保质期
en: Scan expiry date
fr: Scanner la date d'expiration
ja: 撮影して賞味期限を認識

# inventory.expiryScan.noDate
source: 未识别到日期，请手动填写。
en: No date recognized — please enter it manually.
fr: Aucune date reconnue — veuillez la saisir manuellement.
ja: 日付が認識できませんでした。手動で入力してください。

# inventory.expiryScan.pastDate
source: 识别到的日期已过期，请确认或手动填写。
en: The date recognized is already past — please confirm or enter it manually.
fr: La date reconnue est déjà passée — veuillez la confirmer ou la saisir manuellement.
ja: 認識された日付はすでに過去のものです。確認するか手動で入力してください。

# inventory.expiryScan.recognizeFailed %@
source: 识别失败：%@
en: Recognition failed: %@
fr: Échec de la reconnaissance : %@
ja: 認識に失敗しました：%@

# inventory.expiryScan.recognized %lld
source: 已识别到期日，约 %lld 天后过期，可直接保存或修改。
en: Expiry date recognized — about %lld days from now. Save as is, or make changes.
fr: Date d'expiration reconnue — dans environ %lld jours. Enregistrez-la ou modifiez-la.
ja: 賞味期限を認識しました。約%lld日後に期限切れです。そのまま保存するか、編集してください。

# inventory.expiryScan.recognizing
source: 识别中…
en: Recognizing…
fr: Reconnaissance en cours…
ja: 認識中…

# inventory.field.category
source: 分类
en: Category
fr: Catégorie
ja: カテゴリー

# inventory.field.name
source: 名称
en: Name
fr: Nom
ja: 名前

# inventory.field.namePlaceholder
source: 如:牛奶、鸡蛋
en: e.g. milk, eggs
fr: ex. lait, œufs
ja: 例：牛乳、卵

# inventory.field.quantity
source: 数量
en: Quantity
fr: Quantité

# inventory.field.shelfLife
source: 保质期
en: Shelf life
fr: Durée de conservation
ja: 賞味期限

# inventory.field.storage
source: 存放位置
en: Storage
fr: Emplacement
ja: 保存場所

# inventory.field.tags
source: 标签
en: Tags
fr: Étiquettes
ja: タグ

# inventory.field.unit
source: 单位
en: Unit
fr: Unité
ja: 単位

# inventory.filter.all
source: 全部
en: All
fr: Tout
ja: すべて

# inventory.filter.allLocations
source: 全部位置
en: All locations
fr: Tous les emplacements
ja: すべての場所

# inventory.filter.allTags
source: 全部标签
en: All tags
fr: Toutes les étiquettes
ja: すべてのタグ

# inventory.filter.notFresh
source: 不新鲜
en: Not fresh
fr: Pas frais
ja: 新鮮でない

# inventory.freeTierLimit %lld
source: 免费版最多记录 %lld 条库存
en: The free tier tracks up to %lld inventory items
fr: La version gratuite suit jusqu'à %lld articles
ja: 無料版では最大%lld件の在庫を記録できます

# inventory.frequentItems.forget
source: 忘记此项
en: Forget this
fr: Oublier cet article
ja: この項目を削除

# inventory.frequentItems.label
source: 常购食材
en: Frequently bought
fr: Articles fréquents
ja: よく買う食材

# inventory.imageImport.choosePhoto
source: 选择照片
en: Choose a photo
fr: Choisir une photo
ja: 写真を選択

# inventory.imageImport.notConfiguredMessage
source: 在 设置 › AI 助手 填写 Base URL / API Key / 模型 后,即可拍照或选图自动识别食材。
en: Fill in the base URL / API key / model under Settings › AI Assistant, then photos can be recognized automatically.
fr: Renseignez l'URL de base / la clé API / le modèle dans Réglages › Assistant IA, puis les photos pourront être reconnues automatiquement.
ja: 「設定 › AIアシスタント」でベースURL／APIキー／モデルを入力すると、写真から食材を自動認識できます。

# inventory.imageImport.subtitle
source: 从相册选择一张食材或冰箱照片,AI 会识别出可入库的食材供你审核。
en: Pick a photo of groceries or your fridge — AI will recognize items for you to review before adding.
fr: Choisissez une photo de vos courses ou de votre réfrigérateur — l'IA reconnaîtra les articles pour que vous puissiez les vérifier avant l'ajout.
ja: アルバムから食材や冷蔵庫の写真を選ぶと、AIが入庫可能な食材を認識し、確認できます。

# inventory.import.aiRecognizing
source: AI 识别中…
en: AI recognizing…
fr: Reconnaissance IA en cours…
ja: AI認識中…

# inventory.import.pasteText
source: AI 解析文本
en: AI text parse
fr: Analyse de texte IA
ja: AIテキスト解析

# inventory.import.photoRecognize
source: 拍照/相册识别
en: Photo recognition
fr: Reconnaissance photo/galerie
ja: 写真/アルバムで認識

# inventory.import.receipt
source: 扫小票入库
en: Scan receipt
fr: Scanner un reçu
ja: レシートをスキャン

# inventory.import.scanBarcode
source: 扫码添加
en: Scan barcode
fr: Scanner un code-barres
ja: バーコードをスキャン

# inventory.intake.failedRetry
source: 入库失败，请重试
en: Couldn't add to inventory — try again
fr: Impossible d'ajouter au stock — veuillez réessayer
ja: 入庫に失敗しました。再度お試しください

# inventory.intakeReview.confirm %lld
source: 入库 (%lld)
en: Add to inventory (%lld)
fr: Ajouter au stock (%lld)
ja: 入庫 (%lld)

# inventory.intakeReview.confirmTitle
source: 确认入库
en: Confirm intake
fr: Confirmer l'ajout au stock
ja: 入庫を確認

# inventory.intakeReview.confirming
source: 入库中…
en: Adding to inventory…
fr: Ajout au stock en cours…
ja: 入庫中…

# inventory.intakeReview.deselectAll
source: 取消全选
en: Deselect all
fr: Tout désélectionner
ja: すべて選択解除

# inventory.intakeReview.emptyMessage
source: 回到上一屏添加食材后再来。
en: Go back and add some ingredients first.
fr: Revenez en arrière pour ajouter des ingrédients d'abord.
ja: 前の画面で食材を追加してから戻ってきてください。

# inventory.intakeReview.emptyTitle
source: 没有待审核的项目
en: Nothing to review
fr: Rien à vérifier
ja: 確認待ちの項目はありません

# inventory.intakeReview.namePlaceholder
source: 食材名称
en: Ingredient name
fr: Nom de l'ingrédient
ja: 食材名

# inventory.intakeReview.selectAll
source: 全选
en: Select all
fr: Tout sélectionner
ja: すべて選択

# inventory.intakeReview.unnamed
source: (无名)
en: (unnamed)
fr: (sans nom)
ja: （名前なし）

# inventory.load.failedRetry
source: 读取库存失败，请重试。
en: Couldn't load inventory — try again.
fr: Impossible de charger l'inventaire — veuillez réessayer.
ja: 在庫の読み込みに失敗しました。再度お試しください。

# inventory.load.failedShort
source: 库存读取失败，请重试
en: Couldn't load inventory — try again
fr: Impossible de charger l'inventaire — veuillez réessayer
ja: 在庫の読み込みに失敗しました。再度お試しください

# inventory.lowStock.addToShoppingCount %lld
source: 加入购物清单 (%lld)
en: Add to shopping list (%lld)
fr: Ajouter à la liste de courses (%lld)
ja: 買い物リストに追加 (%lld)

# inventory.lowStock.allDuplicate
source: 所选项目已在购物清单中
en: Selected items are already on the shopping list
fr: Les articles sélectionnés sont déjà dans la liste de courses
ja: 選択した項目はすでに買い物リストにあります

# inventory.lowStock.boughtCount %lld
source: 买过 %lld 次
en: Bought %lld times
fr: Acheté %lld fois
ja: %lld回購入

# inventory.lowStock.dueNow %@
source: 该补了 · %@
en: Due for restock · %@
fr: À réapprovisionner · %@
ja: 補充時期 ・ %@

# inventory.lowStock.emptyMessage
source: 买过 3 次以上且当前缺货的食材会出现在这里
en: Items bought 3+ times that are now out of stock show up here
fr: Les articles achetés 3 fois ou plus et actuellement en rupture apparaissent ici
ja: 3回以上購入し、現在欠品中の食材がここに表示されます

# inventory.lowStock.emptyTitle
source: 常买的都在库存里
en: Everything you usually buy is in stock
fr: Tout ce que vous achetez habituellement est en stock
ja: よく買うものはすべて在庫にあります

# inventory.lowStock.everyDays %lld
source: 约每 %lld 天
en: About every %lld days
fr: Environ tous les %lld jours
ja: 約%lld日ごと

# inventory.lowStock.partialFailed
source: 部分项目添加失败，请重试
en: Some items couldn't be added — try again
fr: Certains articles n'ont pas pu être ajoutés — veuillez réessayer
ja: 一部の項目の追加に失敗しました。再度お試しください

# inventory.merge.failed
source: 合并失败
en: Merge failed
fr: Échec de la fusion
ja: 統合に失敗しました

# inventory.merge.success %lld
source: 已合并 %lld 个批次
en: Merged %lld batches
fr: %lld lots fusionnés
ja: %lldバッチを統合しました

# inventory.nutrition.additives %lld
source: %lld 种添加剂
en: %lld additives
fr: %lld additifs
ja: 添加物%lld種

# inventory.nutrition.carbs
source: 碳水
en: Carbs
fr: Glucides
ja: 炭水化物

# inventory.nutrition.eco %@
source: 环保 %@
en: Eco %@
fr: Éco %@
ja: エコ %@

# inventory.nutrition.energy
source: 热量
en: Energy
fr: Énergie
ja: 熱量

# inventory.nutrition.fat
source: 脂肪
en: Fat
fr: Lipides
ja: 脂質

# inventory.nutrition.header %@
source: 营养成分 · %@
en: Nutrition · %@
fr: Valeurs nutritionnelles · %@
ja: 栄養成分 ・ %@

# inventory.nutrition.nova %lld
source: 加工度 NOVA %lld
en: Processing level NOVA %lld
fr: Niveau de transformation NOVA %lld

# inventory.nutrition.per100g
source: 每 100g
en: Per 100g
fr: Par 100 g
ja: 100gあたり

# inventory.nutrition.protein
source: 蛋白质
en: Protein
fr: Protéines
ja: タンパク質

# inventory.pasteImport.imageEmptyResult
source: 未能从图片中识别出食材，请换一张更清晰的照片重试。
en: Couldn't recognize any ingredients in the photo — try a clearer one.
fr: Aucun ingrédient n'a pu être reconnu dans la photo — essayez-en une plus nette.
ja: 画像から食材を認識できませんでした。より鮮明な写真でお試しください。

# inventory.pasteImport.notConfiguredMessage
source: 在 设置 › AI 助手 填写 Base URL / API Key / 模型 后,即可粘贴文本自动解析食材。
en: Fill in the base URL / API key / model under Settings › AI Assistant, then pasted text can be parsed automatically.
fr: Renseignez l'URL de base / la clé API / le modèle dans Réglages › Assistant IA, puis le texte collé pourra être analysé automatiquement.
ja: 「設定 › AIアシスタント」でベースURL／APIキー／モデルを入力すると、テキストを貼り付けて食材を自動解析できます。

# inventory.pasteImport.parse
source: 解析
en: Parse
fr: Analyser

# inventory.pasteImport.parseFailed %@
source: 解析失败：%@
en: Parsing failed: %@
fr: Échec de l'analyse : %@
ja: 解析に失敗しました：%@

# inventory.pasteImport.parsing
source: 解析中…
en: Parsing…
fr: Analyse en cours…

# inventory.pasteImport.placeholder
source: 如:牛奶 2 盒、鸡蛋一打、西红柿 3 个…
en: e.g. 2 boxes of milk, a dozen eggs, 3 tomatoes…
fr: ex. 2 boîtes de lait, une douzaine d'œufs, 3 tomates…
ja: 例：牛乳2箱、卵1ダース、トマト3個…

# inventory.pasteImport.subtitle
source: 粘贴一段食材清单,AI 会拆成结构化条目供你审核入库。
en: Paste a list of ingredients — AI will break it into structured entries for you to review.
fr: Collez une liste d'ingrédients — l'IA la découpera en entrées structurées à vérifier.
ja: 食材リストを貼り付けると、AIが構造化された項目に分解し、確認できます。

# inventory.pasteImport.textEmptyResult
source: 未能从文本中解析出食材，请调整后重试。
en: Couldn't parse any ingredients from the text — adjust it and try again.
fr: Aucun ingrédient n'a pu être extrait du texte — ajustez-le et réessayez.
ja: テキストから食材を解析できませんでした。内容を調整して再度お試しください。

# inventory.photo.loadFailed %@
source: 读取照片失败：%@
en: Couldn't load the photo: %@
fr: Impossible de charger la photo : %@
ja: 写真の読み込みに失敗しました：%@

# inventory.photo.loadFailedRetry
source: 读取照片失败，请重试。
en: Couldn't load the photo — try again.
fr: Impossible de charger la photo — veuillez réessayer.
ja: 写真の読み込みに失敗しました。再度お試しください。

# inventory.photo.processFailed
source: 无法处理该照片，请换一张重试。
en: Couldn't process this photo — try a different one.
fr: Impossible de traiter cette photo — essayez-en une autre.
ja: この写真を処理できません。別の写真でお試しください。

# inventory.picker.category
source: 选择分类
en: Choose a category
fr: Choisir une catégorie
ja: カテゴリーを選択

# inventory.picker.storage
source: 存放位置
en: Storage
fr: Emplacement
ja: 保存場所

# inventory.picker.unit
source: 选择单位
en: Choose a unit
fr: Choisir une unité
ja: 単位を選択

# inventory.provenance.ai
source: AI 推断
en: AI inferred
fr: Inféré par l'IA
ja: AI推定

# inventory.provenance.system
source: 系统
en: System
fr: Système
ja: システム

# inventory.provenance.user
source: 手填
en: Manual
fr: Manuel
ja: 手入力

# inventory.provenance.userEdited
source: 手改
en: Edited
fr: Modifié
ja: 編集済み

# inventory.receiptImport.choosePhoto
source: 选择小票照片
en: Choose a receipt photo
fr: Choisir une photo de reçu
ja: レシートの写真を選択

# inventory.receiptImport.notConfiguredMessage
source: 在 设置 › AI 助手 填写 Base URL / API Key / 模型 后,即可拍小票自动识别食材入库。
en: Fill in the base URL / API key / model under Settings › AI Assistant, then receipts can be recognized automatically.
fr: Renseignez l'URL de base / la clé API / le modèle dans Réglages › Assistant IA, puis les reçus pourront être reconnus automatiquement.
ja: 「設定 › AIアシスタント」でベースURL／APIキー／モデルを入力すると、レシートを撮影して食材を自動認識できます。

# inventory.receiptImport.recognizeFailed %@
source: 识别小票文字失败：%@
en: Receipt recognition failed: %@
fr: Échec de la reconnaissance du reçu : %@
ja: レシートの文字認識に失敗しました：%@

# inventory.receiptImport.recognizing
source: 识别小票文字中…
en: Recognizing receipt text…
fr: Reconnaissance du texte du reçu…
ja: レシートの文字を認識中…

# inventory.receiptImport.subtitle
source: 拍一张购物小票,先在本机离线识别文字,再由 AI 拆成可入库的食材供你审核。
en: Photograph a receipt — text is recognized on-device first, then AI breaks it into ingredients for you to review.
fr: Photographiez un reçu — le texte est d'abord reconnu hors ligne sur l'appareil, puis l'IA le découpe en ingrédients à vérifier.
ja: レシートを撮影すると、まず端末内でオフライン文字認識を行い、次にAIが入庫可能な食材に分解して確認できます。

# inventory.remove.failed %@
source: 移除「%@」失败，请重试
en: Couldn't remove “%@” — try again
fr: Impossible de retirer « %@ » — veuillez réessayer
ja: 「%@」の削除に失敗しました。再度お試しください

# inventory.removeOutcome.composted
source: 堆肥了
en: Composted
fr: Composté
ja: 堆肥にした

# inventory.removeOutcome.consumed
source: 吃完 / 用掉了
en: Eaten / used up
fr: Mangé / utilisé
ja: 食べた／使い切った

# inventory.removeOutcome.donated
source: 捐了
en: Donated
fr: Donné
ja: 寄付した

# inventory.removeOutcome.genericTitle
source: 移除食材
en: Remove ingredient
fr: Retirer l'ingrédient
ja: 食材を削除

# inventory.removeOutcome.message
source: 它怎么了?用于统计你的减废成效。
en: What happened to it? This feeds your waste-reduction stats.
fr: Qu'est-il devenu ? Cela alimente vos statistiques anti-gaspillage.
ja: どうなりましたか？廃棄削減の統計に使用されます。

# inventory.removeOutcome.recorded %@
source: 已记录「%@」
en: Recorded “%@”
fr: « %@ » enregistré
ja: 「%@」を記録しました

# inventory.removeOutcome.removeOnly
source: 仅移除
en: Just remove
fr: Retirer seulement
ja: 削除のみ

# inventory.removeOutcome.title %@
source: 「%@」要移除
en: Remove “%@”
fr: Retirer « %@ »
ja: 「%@」を削除しますか

# inventory.removeOutcome.wasted
source: 没吃完,扔了
en: Didn't finish, thrown out
fr: Pas terminé, jeté
ja: 食べきれず廃棄した

# inventory.scan.deviceUnsupported
source: 此设备不支持扫码
en: This device can't scan
fr: Cet appareil ne peut pas scanner
ja: このデバイスはスキャンに対応していません

# inventory.scan.hint
source: 将条形码对准取景框
en: Align the barcode within the frame
fr: Alignez le code-barres dans le cadre
ja: バーコードをフレームに合わせてください

# inventory.scan.lookingUpBarcode
source: 查询条码中…
en: Looking up barcode…
fr: Recherche du code-barres…
ja: バーコードを検索中…

# inventory.scan.requiresDevice
source: 需真机
en: Needs real device
fr: Nécessite un appareil réel
ja: 実機が必要

# inventory.scan.unavailableMessage
source: 此设备不支持扫码，请在真机上使用，或手动填写。
en: This device can't scan. Use a real device, or fill in the details manually.
fr: Cet appareil ne peut pas scanner. Utilisez un appareil réel, ou saisissez les informations manuellement.
ja: このデバイスはスキャンに対応していません。実機で使用するか、手動で入力してください。

# inventory.scan.unavailableTitle
source: 无法扫码
en: Can't scan
fr: Impossible de scanner
ja: スキャンできません

# inventory.scan.useRealDevice
source: 请在真机上使用，或返回手动填写。
en: Use a real device, or go back and fill it in manually.
fr: Utilisez un appareil réel, ou revenez pour saisir les informations manuellement.
ja: 実機で使用するか、戻って手動で入力してください。

# inventory.selection.count %lld
source: 已选 %lld 项
en: %lld items selected
fr: %lld articles sélectionnés
ja: %lld件選択中

# inventory.shelfLife.custom
source: 自定义
en: Custom
fr: Personnalisé
ja: カスタム

# inventory.shelfLife.dayCount
source: 天数
en: Days
fr: Jours
ja: 日数

# inventory.shelfLife.days %lld
source: %lld天
en: %lld days
fr: %lld jours
ja: %lld日

# inventory.shelfLife.never
source: 不过期
en: Never expires
fr: N'expire jamais
ja: 期限なし

# inventory.shelfLife.unitDay
source: 天
en: days
fr: jours
ja: 日

# inventory.spotlight.notFound
source: 该食材已不在库存
en: This item is no longer in inventory
fr: Cet article n'est plus en stock
ja: この食材はすでに在庫にありません

# inventory.tags.add
source: 添加标签
en: Add tag
fr: Ajouter une étiquette
ja: タグを追加

# inventory.tags.addPlaceholder
source: 添加标签,如 囤货、孩子的
en: Add a tag, e.g. stockpile, kids'
fr: Ajouter une étiquette, ex. stock, enfants
ja: タグを追加（例：ストック、子供用）

# inventory.tags.remove %@
source: 删除标签 %@
en: Remove tag %@
fr: Retirer l'étiquette %@
ja: タグ%@を削除

# inventory.title
source: 库存
en: Inventory
fr: Inventaire
ja: 在庫

# inventory.undo.failed
source: 撤销失败，请重试
en: Couldn't undo — try again
fr: Impossible d'annuler — veuillez réessayer
ja: 取り消しに失敗しました。再度お試しください

# inventory.unit.ba
source: 把
en: bunch
fr: botte
ja: 束

# inventory.unit.bao
source: 包
en: pack
fr: paquet
ja: パック

# inventory.unit.bei
source: 杯
en: cup
fr: tasse

# inventory.unit.dai
source: 袋
en: bag
fr: sac

# inventory.unit.fen
source: 份
en: serving
fr: portion
ja: 食分

# inventory.unit.ge
source: 个
en: pcs
fr: pièce
ja: 個

# inventory.unit.gen
source: 根
en: stalk
fr: tige
ja: 本

# inventory.unit.guan
source: 罐
en: can
fr: boîte
ja: 缶

# inventory.unit.he
source: 盒
en: box
fr: boîte
ja: 箱

# inventory.unit.ke
source: 颗
en: piece
fr: pièce
ja: 個

# inventory.unit.pian
source: 片
en: slice
fr: tranche
ja: 枚

# inventory.unit.ping
source: 瓶
en: bottle
fr: bouteille
ja: 本

# inventory.unit.shao
source: 勺
en: spoon
fr: cuillère
ja: さじ

# inventory.unit.shiliang
source: 适量
en: to taste
fr: à volonté
ja: 適量

# inventory.unit.zhi
source: 只
en: whole
fr: unité
ja: 匹

# inventory.voice.start
source: 语音录入
en: Voice input
fr: Saisie vocale
ja: 音声入力

# inventory.voice.startAccessibility
source: 语音录入食材
en: Add ingredients by voice
fr: Ajouter des ingrédients par la voix
ja: 音声で食材を入力

# inventory.voice.stop
source: 停止录音
en: Stop recording
fr: Arrêter l'enregistrement
ja: 録音を停止

# inventory.voice.stopAccessibility
source: 停止语音录入
en: Stop voice input
fr: Arrêter la saisie vocale
ja: 音声入力を停止

# mealPlan.add
source: 添加
en: Add
fr: Ajouter
ja: 追加

# mealPlan.addFailed
source: 添加失败,请重试
en: Add failed. Please try again.
fr: Échec de l'ajout. Veuillez réessayer.
ja: 追加に失敗しました。再試行してください

# mealPlan.addNote
source: 添加便签
en: Add Note
fr: Ajouter une note
ja: メモを追加

# mealPlan.addRecipe
source: 添加菜谱
en: Add Recipe
fr: Ajouter une recette
ja: レシピを追加

# mealPlan.addRecipeOrNote
source: 添加菜谱或便签
en: Add Recipe or Note
fr: Ajouter une recette ou une note
ja: レシピまたはメモを追加

# mealPlan.addedPartialFailed %lld %lld
source: 已加入 %lld 样，%lld 样添加失败
en: Added %lld items; %2$lld failed
fr: %lld articles ajoutés ; %lld ont échoué
ja: %lld点を追加しましたが、%lld点失敗しました

# mealPlan.addedToShopping %lld
source: 已加入 %lld 样食材到购物清单
en: Added %lld ingredients to the shopping list
fr: %lld ingrédients ajoutés à la liste de courses
ja: 購入リストに%lld点の食材を追加しました

# mealPlan.backToToday
source: 回到今天
en: Back to Today
fr: Revenir à aujourd'hui
ja: 今日に戻る

# mealPlan.cancel
source: 取消
en: Cancel
fr: Annuler
ja: キャンセル

# mealPlan.deductHint %@
source: 按「%@」的食材清单生成扣减审核,可逐项调整或跳过。
en: Generates a deduction review from “%@”'s ingredient list — adjust or skip any item before confirming.
fr: Génère une vérification de déduction à partir de la liste d'ingrédients de « %@ » — ajustez ou ignorez chaque article avant de confirmer.
ja: 「%@」の食材リストから減算確認を生成します。各項目を調整またはスキップできます。

# mealPlan.deductPrompt
source: 顺便扣减库存？
en: Also deduct from inventory?
fr: Déduire aussi de l'inventaire ?
ja: ついでに在庫を減算しますか？

# mealPlan.deductStock
source: 扣减库存
en: Deduct Stock
fr: Déduire du stock
ja: 在庫を減算

# mealPlan.deductedItems %lld
source: 已扣减 %lld 项库存
en: Deducted %lld inventory items
fr: %lld articles d'inventaire déduits
ja: 在庫を%lld件減算しました

# mealPlan.delete
source: 删除
en: Delete
fr: Supprimer
ja: 削除

# mealPlan.deleteFailed
source: 删除失败,请重试
en: Delete failed. Please try again.
fr: Échec de la suppression. Veuillez réessayer.
ja: 削除に失敗しました。再試行してください

# mealPlan.dishesPlanned %lld
source: 已计划 %lld 道菜
en: %lld dishes planned
fr: %lld plats prévus
ja: %lld品を予定

# mealPlan.dishesTag %lld
source: ，%lld 道菜
en: , %lld dishes
fr: , %lld plats
ja: 、%lld品

# mealPlan.done
source: 完成
en: Done
fr: Terminé
ja: 完了

# mealPlan.emptyDayMessage
source: 点「添加菜品」安排今天吃什么
en: Tap “Add Dish” to plan today's meal
fr: Appuyez sur « Ajouter un plat » pour planifier le repas d'aujourd'hui
ja: 「料理を追加」をタップして今日の食事を決めましょう

# mealPlan.emptyDayTitle
source: 这天还没有计划
en: Nothing Planned for This Day Yet
fr: Rien n'est encore prévu pour ce jour
ja: この日はまだ予定がありません

# mealPlan.leftover
source: 剩菜
en: Leftover
fr: Reste
ja: 残り物

# mealPlan.markDone
source: 标记为已完成
en: Mark as Done
fr: Marquer comme terminé
ja: 完了にする

# mealPlan.markUndone
source: 标记为未完成
en: Mark as Not Done
fr: Marquer comme non terminé
ja: 未完了にする

# mealPlan.missing.thatWeek %lld
source: 这一周还缺 %lld 样食材
en: Still missing %lld items that week
fr: Encore %lld articles manquants cette semaine-là
ja: その週まだ%lld点の食材が不足

# mealPlan.missing.thisWeek %lld
source: 本周还缺 %lld 样食材
en: Still missing %lld items this week
fr: Encore %lld articles manquants cette semaine
ja: 今週まだ%lld点の食材が不足

# mealPlan.missingAlreadyInShopping
source: 缺的食材都已在购物清单中
en: All missing ingredients are already on the shopping list
fr: Tous les ingrédients manquants sont déjà dans la liste de courses
ja: 不足している食材はすべて購入リストに追加済みです

# mealPlan.move
source: 移动
en: Move
fr: Déplacer
ja: 移動

# mealPlan.moveDish %@
source: 移动「%@」
en: Move “%@”
fr: Déplacer « %@ »
ja: 「%@」を移動

# mealPlan.moveTo
source: 移动到
en: Move to
fr: Déplacer vers
ja: 移動先

# mealPlan.moveToOtherDate
source: 移到其他日期
en: Move to Another Date
fr: Déplacer vers une autre date
ja: 他の日付に移動

# mealPlan.nextWeek
source: 下一周
en: Next Week
fr: Semaine suivante
ja: 次の週

# mealPlan.noMatchingRecipes
source: 没有匹配的菜谱
en: No Matching Recipes
fr: Aucune recette correspondante
ja: 一致するレシピがありません

# mealPlan.noPlan
source: 暂无计划
en: Nothing Planned
fr: Rien de prévu
ja: 予定なし

# mealPlan.noRecipesAvailable
source: 暂无可选的菜谱
en: No Recipes Available
fr: Aucune recette disponible
ja: 選択できるレシピがまだありません

# mealPlan.note
source: 便签
en: Note
fr: Note
ja: メモ

# mealPlan.previousWeek
source: 上一周
en: Previous Week
fr: Semaine précédente
ja: 前の週

# mealPlan.save
source: 保存
en: Save
fr: Enregistrer

# mealPlan.selectDish
source: 选择菜品
en: Select Dish
fr: Sélectionner un plat
ja: 料理を選択

# mealPlan.servings %lld
source: %lld 份
en: %lld servings
fr: %lld portions
ja: %lld人分

# mealPlan.skip
source: 跳过
en: Skip
fr: Ignorer
ja: スキップ

# mealPlan.template.apply
source: 应用模板
en: Apply Template
fr: Appliquer un modèle
ja: テンプレートを適用

# mealPlan.template.dishCount %lld
source: %lld 道菜
en: %lld dishes
fr: %lld plats
ja: %lld品

# mealPlan.template.empty
source: 还没有保存的模板
en: No Saved Templates Yet
fr: Pas encore de modèles enregistrés
ja: 保存されたテンプレートがまだありません

# mealPlan.template.namePlaceholder
source: 模板名称(如:工作日)
en: Template name (e.g. Weekdays)
fr: Nom du modèle (ex. jours de semaine)
ja: テンプレート名（例：平日）

# mealPlan.template.saveAs
source: 存为模板
en: Save as Template
fr: Enregistrer comme modèle
ja: テンプレートとして保存

# mealPlan.template.saveHint
source: 把本周的菜谱保存成可复用的模板
en: Save this week's recipes as a reusable template
fr: Enregistrez les recettes de cette semaine comme modèle réutilisable
ja: 今週のレシピを再利用可能なテンプレートとして保存します

# mealPlan.template.saveThisWeek
source: 本周存为模板
en: Save This Week as Template
fr: Enregistrer cette semaine comme modèle
ja: 今週をテンプレートとして保存
